
public class JAVA_01_05 {
	
	public static void main(String[] args) {
		
		// 자바에서 변수의 이름에 규칙과 관계가 있다.
		// 규칙은 필수로 지켜야 한다. (지키지 않으면 컴파일 오류가 발생한다.)
		// 관례는 필수는 아니지만 전세계 개발자가 해당 관례를 따르기 때문에 사실상 규칙이라고 생각해야 한다.
		
		// 규칙
		/*
		1. 변수 이름은 숫자로 시작할 수 없다. (예: 1num, 1st)
			그러나 숫자를 이름에 포함하는 것은 가능하다.
		2. 이름에는 공백이 들어갈 수 없다.
		3. 자바의 예약어를 변수 이름으로 사용할 수 없다. (예: int, class, public)
		4. 변수 이름에는 영문자, 숫자, 달러 기호($), 밑줄(_)만 사용할 수 있다.
		*/
		
		// 관례
		/*
		1. 소문자로 시작하는 낙타 표기법(camel case)을 사용한다.
			여러 단어로 이루어진 변수 이름의 경우, 첫 번째 단어는 소문자로 하고 그 이후에 각 단어는 대문자로 시작
			낙타표기법은 프로그램이에서 변수, 함수, 클래스 등의 이름을 지을 때 많이 사용하는 표기법 중 하나이다.
			낙타표기법을 사용하면 이름에 공백을 넣지 않고도 여러 단어를 쉽게 구분할 수 있으므로, 변수의 이름을 이해하기 쉽게 만들어준다.
			또한, 대부분의 프로그래밍 언어에서는 이름에 공백을 포함할 수 없기 때문에, 제한을 우회하는 좋은 방법이다.
		 */
	}

}
