
public class JAVA_01_01 {
	
	public static void main(String[] args) {
		
		// Java는 대소문자를 구분한다.
		// 파일명과 클래스 이름은 반드시 같아야 한다.

		// main은 메서드라고 한다.
		// Java는 main 메서드를 찾아서 프로그램을 시작한다.
		// 즉, 시작 지점이다.
		
		// 문자열을 사용할 때 "(쌍따옴표)를 사용한다.
		// 세미콜론(;)으로 문장을 구분한다. 문장이 끝나면 세미콜론을 필수로 넣어줘야 한다.
		// 스페이스 4번을 통해 가독성을 높여주는 것이 관례다.
		
		// //는 주석으로, 사람에게 부가 설명을 할 수 있는 기능이다.
		// 여러 줄을 주석으로 하고 싶으면, /* */ 를 사용한다.
		
		System.out.println("Hello Java");
		
		// Java 프로그램은 컴파일과 실행 단계를 거친다.
		// Java 컴파일러를 사용해서 소스 코드를 컴파일 한다.
		// Java가 제공하는 javac 라는 프로그램을 사용한다.
		// Java는 자바 가상 머신(JVM)이 실행되면서 프로그램이 작동된다.
		
		// 인텔리제이(Intellij)는 내부에 Java를 편리하게 설치하고 관리할 수 있는 기능을 제공한다.
		// Java 코드를 컴파일 하려면 javac 라는 프로그램을 직접 사용해야 하지만, 인텔리제이는 Java 코드를 실행할 때 이 과정을 자동으로 처리해준다.
		// 자바를 실행하려면 java 라는 프로그램을 사용해야 하는데, 이때 컴파일된 .class 파일을 지정해주면 된다. (확장자는 제외한다)
		// 인텔리제이에서 java 코드를 실행하면 컴파일과 실행을 한번에 처리한다.
		// 일반적인 프로그램은 다른 운영체제에서 실행할 수 없는데, java는 상관없다. (java가 설치된이라는 전제 필요)
		
		// 개발자들은 개발의 편의를 위해 윈도우나 MAC OS를 주로 사용하고, 서버는 주로 리눅스를 사용한다.
		
	}

}
